import Question_1 from "../assets/Question_1.png";
import Question_2 from "../assets/Question_2.jpg";
import Question_3 from "../assets/Question_3.png";
import Question_4 from "../assets/Question_4.png";
import Question_5 from "../assets/Question_5.png";
import Question_6 from "../assets/Question_6.jpg";
import Question_7 from "../assets/Question_7.png";
import Question_8 from "../assets/Question_8.png";

export const initialUsersList = [
  {
    name: "",
    result: {
      1: { value: "", key: "" },
      2: { value: "", key: "" },
      3: { value: "", key: "" },
      4: { value: "", key: "" },
      5: { value: "", key: "" },
      6: { value: "", key: "" },
      7: { value: "", key: "" },
      8: { value: "", key: "" },
    },
  },
];

export const stepsValues = {
  init: "init",
  poll: "poll",
  final: "final",
};

export const LEVELS = {
  5: "Відмінно",
  4: "Добре",
  3: "Задовільно",
  2: "Потребує покращення",
  1: "Низький",
};

export const questions = [
  {
    title: "Фотостимульована реакційна спритність у гандболі",
    img: Question_1,
    parameters: {
      position: "На 9-метровій лінії розміщені 5 стійок із світлодіодами.",
      task: "Реагувати на світловий сигнал, переміщуючись до відповідної стійки, торкатися її та повертатися на початкову позицію.",
      evaluation:
        "Кількість правильних реакцій за певний час. Час реакції та загальний час виконання.",
    },

    indicators: {
      5: { min: 21 },
      4: { min: 17, max: 20 },
      3: { min: 13, max: 16 },
      2: { min: 9, max: 12 },
      1: { max: 9 },
    },
  },
  {
    title:
      "Двохчастотна кольорова диференціація як метод оцінки кооперативної моторної відповіді",
    img: Question_2,
    parameters: {
      position:
        "10 стійок із світлодіодами розташовані у колі діаметром 6 метрів.",
      task: "Виконувати ривки до стійки з відповідним кольором світла.",
      evaluation:
        "Кількість виконаних ривків за одну хвилину. Враховується швидкість виконання та точність вибору стійки.",
    },
    indicators: {
      5: { min: 11 },
      4: { min: 9, max: 10 },
      3: { min: 7, max: 8 },
      2: { min: 5, max: 6 },
      1: { max: 4 },
    },
  },
  {
    title:
      "Квантифікація інтегрованої візуомоторної координації та динамічної прецизійності в кидках",
    img: Question_3,
    parameters: {
      position:
        "На ігровому майданчику розміщені стійки зі світлодіодними лампами, які можуть вмикатися для позначення цілі для кидка.",
      task: "Гравчині виконують кидки у ворота, намагаючись вразити конкретні зони, які позначені активним світлом. Світлодіоди можуть змінювати своє розташування для імітації різних ігрових ситуацій.",
      evaluation:
        "Точність кидків: враховується кількість точних ударів у визначені світлодіодами зони.Швидкість реакції: вимірюється час від моменту активації світлодіоду до моменту виконання кидка.",
    },
    indicators: {
      5: { min: 6 },
      4: { max: 5 },
      3: { max: 4 },
      2: { max: 3 },
      1: { max: 2 },
    },
  },
  {
    title:
      "Інтегративна оцінка функціонально-технічної майстерності у гандболі",
    img: Question_4,
    parameters: {
      position:
        "Тест включає використання світлових індикаторів (світлодіодів) для позначення маршруту переміщення гравця та цілей для кидків. Стійки зі світлодіодами розміщуються на ключових точках ігрового поля.",
      task: "Гравець виконує різноманітні дії, починаючи з переміщення між світловими стійками, ведення м’яча, оббігання стійок, що імітують противників, та завершуючи кидками в ціль, визначену світлодіодами.",
      evaluation:
        "Швидкість виконання: вимірюється загальний час, необхідний для завершення всіх завдань тесту.Точність кидків: оцінюється кількість влучних кидків у визначені світлодіодами зони. Технічна майстерність: враховуються плавність виконання техніко-тактичних дій та відсутність помилок. Технічна майстерність: враховуються плавність виконання техніко-тактичних дій та відсутність помилок.",
    },
    indicators: {
      5: { max: 35 },
      4: { min: 36, max: 40 },
      3: { min: 41, max: 45 },
      2: { min: 46, max: 50 },
      1: { min: 51 },
    },
  },
  {
    title:
      "Оцінка селективної візуальної уваги та моторної відповіді через ізольовану фотостимуляцію",
    img: Question_5,
    parameters: {
      position:
        "Гравчиня займає позицію у центрі 6-метрової лінії. На 9-метровій лінії встановлені 5 стійок із світлодіодами, які можуть загорятися різними кольорами.",
      task: "Реагувати тільки на зелене світло, ігноруючи червоне.",
      evaluation:
        "Кількість правильних реакцій вимірюється кількістю успішних ривків до стійки зі згаслим зеленим світлом за певний час.Час реакції визначається від часу загоряння зеленого світла до моменту початку руху гравця.Загальний час – загальна тривалість виконання вправи від початкового руху до повернення на вихідну позицію після останнього правильного торкання.",
    },
    indicators: {
      5: { min: 20 },
      4: { min: 15, max: 19 },
      3: { min: 10, max: 14 },
      2: { min: 5, max: 9 },
      1: { max: 5 },
    },
  },
  {
    title:
      "Бінарна кольорова стимуляція у контексті парної моторної синхронізації",
    img: Question_6,
    parameters: {
      position:
        "Гравчиня у центрі 6-метрової лінії. Розташування по 5 стійок стійок для кожної гандболістки (одна зліва і справа від гандболіста на 6-метровій лінії та три на 9-метровій лінії), оснащені світлодіодами, які можуть загорятися різними кольорами.",
      task: "Cпортсменки реагують тільки на зелене світло, здійснюючи вихід до вказаної стійки. Червоне світло виступає як подразник і його слід ігнорувати.",
      evaluation:
        "Швидкість реакції: час від моменту загоряння зеленого світла до моменту реакції гравця.Точність виконання: відсоток правильно виконаних реакцій на зелене світло порівняно з кількістю подразників.Взаємодія гравчинь: оцінка здатності спортсменок уникати зіткнень та ефективно координувати свої дії на обмеженому просторі.",
    },
    indicators: {
      5: { min: 30 },
      4: { min: 24, max: 29 },
      3: { min: 18, max: 23 },
      2: { min: 12, max: 17 },
      1: { max: 12 },
    },
  },
  {
    title:
      "Оцінка візуомоторної інтеграції та прецизійності реакції на зорові стимули у кидках по воротах: протокол аналізу дискретної візуальної точності",
    img: Question_7,
    parameters: {
      position: "Відстань до платформи 10 метрів від гандболістки.",
      task: "Виконати кидок у коло на платформі, де загоряється зелене світло.",
      evaluation:
        "Точність: кількість точних кидків у цільове коло з зеленим світлом. Швидкість реакції: час від моменту з'явлення зеленого світла до виконання кидка. Загальна кількість кидків: загальна кількість кидків, зроблених за хвилину, незалежно від точності.",
    },
    indicators: {
      5: { min: 25 },
      4: { min: 20, max: 24 },
      3: { min: 15, max: 19 },
      2: { min: 10, max: 14 },
      1: { max: 10 },
    },
  },
  {
    title:
      "Квантитативна аналітика диференційованої візуомоторної відповіді: протокол оцінки точності кидка з вибірковою увагою на кольорові стимули",
    img: Question_8,
    parameters: {
      position: "Відстань кидка 10 метрів.",
      task: "Виконати кидки у ворота, реагуючи лише на зелене світло.",
      evaluation:
        "Точність кидків: кількість кидків, що точно потрапили у зелене коло. Швидкість реакції: швидкість реакції на появу зеленого світла та ігнорування червоного. Загальна кількість спроб: кількість усіх зроблених кидків за хвилину, незалежно від їх точності.",
    },
    indicators: {
      5: { min: 20 },
      4: { min: 16, max: 19 },
      3: { min: 11, max: 15 },
      2: { min: 6, max: 10 },
      1: { max: 6 },
    },
  },
];
